<html>
<body>
<h2>Module 3 - Final Project!</h2>

<h1>Text Quest-Game</h1>
Ти прокидаєшся в темному, незнайомому приміщенні. Все навколо покрите пилом, і ти не пам'ятаєш, як ти сюди потрапив. Перед тобою дві двері - одна ліва, інша права.

Етап 1: Прокинься у незнайомому місці

Ти прокидаєшся на старому ліжку в темному приміщенні. Навколо тебе лише слабкий світлофор, а повітря наповнене старим запахом пилу. Перед тобою дві двері.

Відкрити ліву двері.
Відкрити праву двері.
Етап 2: Обирай шлях

Ліва двері виводять тебе в темний коридор, а праві - у старий лабораторний кабінет.

Пройти коридор.
Увійти в лабораторію.
Етап 3: Таємниці лабораторії

В лабораторії ти бачиш дивні прилади та експериментальні пристрої. За столом сидить дивна постать в білому халаті.

Спитати, де ти знаходишся.
Шукати вихід з лабораторії.
Етап 4: Зустріч із загадковою постаттю

Постать пояснює, що ти опинився в часовому петлі. Тобі потрібно знайти спосіб вибратися.

Погодитися приєднатися до постаті.
Відмовитися і шукати вихід самостійно.
Етап 5: Пошук вихідного шляху

Ти вирушаєш у подорож лабіринтом коридорів та кімнат. Знаходження вихідного шляху - ключ до твоєї свободи.

Піти вглиб лабіринту.
Повернутися на попередній рівень.

Етап 6: Столкнення з перешкодами

Ти зустрічаєш різноманітні перешкоди на своєму шляху: важкі двері, кодові замки, та дивні головоломки.

Розв'язати головоломку.
Шукати обхідні шляхи.
Етап 7: Зустріч з іншими "потерпілими"

Ти знаходиш інших людей, які теж опинилися в цій часовій петлі. Разом ви можете знайти вихід.

Об'єднатися з групою.
Продовжити шукати вихід самостійно.
Етап 8: Розкриття таємниці

Група знаходить архів лабораторії, де розкривають темні секрети експериментів, що призвели до цієї ситуації.

Залишитися і дізнатися більше.
Прискорити пошуки виходу.
Етап 9: Вибір шляху виходу

Ви доходите до центральної кімнати, де знаходиться вихід. Але перед вами стоїть остаточний вибір.

Вийти через вихід і завершити експеримент.
Використовувати знання архіву для зміни умов експерименту.

Етап 10: Завершення гри

Ваш вибір визначає кінцевий результат. Ваша історія може закінчитися звільненням або зміною ходу подій у лабораторії.

Гра завершена. Дякуємо за гру!








</body>
</html>

